* bugs and enhancements

** bugs

*** TODO "ankiimport -RB" puts (some) cards back in "new" state

somehow, some cards are ending up back in new state.  maybe half?

so, turkish-2016 is the deck in question.  it has 214 new cards (mac
version).

this [[file:before.mobile.review.txt][file]] shows state before reviewing, synching from mobile.

now, synch from mobile.  launch anki.  it says 104 new cards.  [[file:after.mobile.review.txt][here]] is
the state after that synch, launching (and quitting!) of anki.

now, create a new HTML file, and use ankiimport to import it, but
don't yet launch anki.
#+BEGIN_EXAMPLE
bash greg-minshalls-mbp-2: {1203} date; i=turkish-2016; ./genhtml-bothsides.sh -t $i.txt >| $i.html
Sun Mar 13 09:58:05 EET 2016
bash greg-minshalls-mbp-2: {1204} ./import.sh -RB turkish-2016
1 note added, 525 notes updated, 0 notes unchanged.
will delete 1 card from deck turkish-2016
proceed with import? [y/n] y
#+END_EXAMPLE

[[file:after.mobile.review.ankiimport.txt][here]] is the state there.  it differs in the
"due" field, but not much else:
#+BEGIN_SRC sh :results raw
sed 'sX^new/[0-9]*:Xnew/:X' after.mobile.review.ankiimport.txt > y
sed 'sX^new/[0-9]*:Xnew/:X' after.mobile.review.txt > z
diff y z | less
#+END_SRC

#+RESULTS:
294a295
> due/1053: <div align="center">canvas (for painting)</div>	<div align="center">tuval</div>
526d526
< new/: <div align="center">canvass (for painting)</div>	<div align="center">tuval</div>

now, launch anki.  it says 105 cards.  [[file:after.mobile.review.ankiimport.anki.txt][here]] is the output.
#+BEGIN_SRC sh :results raw
sed 'sX^new/[0-9]*:Xnew/:X' after.mobile.review.ankiimport.txt > y
sed 'sX^new/[0-9]*:Xnew/:X' after.mobile.review.ankiimport.anki.txt > z
diff y z | less
#+END_SRC

#+RESULTS:

no change.  hmm.  download to mobile.  mobile shows 105 cards left.

so, this didn't repeat the problem.  sigh.

14.03.2016 -- importing into my normal, it happened again that a
number 

my sequence was to run ankiimport *before* synching with ankiweb.
it's possible that what's happening is that the cards i reviewed
*today*, having been marked updated, are not going to later be updated
by synching with ankiweb (when i actually launch Anki).

but, e.g.,
----
okur | reader
----
(from 08.03.2016) is marked "new".  it wouldn't be new.

instrument ~/docs/mine/flashcards/import shellscript to log "^new"
before and after import.

well, actually, in yesterday's example, okur was included as "new".

#+name: newcards
#+BEGIN_SRC sh :results raw
./ankicards --user User\ 1 --deck turkish-2016 | grep ^new
#+END_SRC

so, after reviewing everything on iphone, and synching from iphone,
then launching and closing anki, *no* new cards remain:
#+call: newcards()

#+RESULTS:
: nil

run ./import in flashcards.  still no new cards
#+call: newcards()

#+RESULTS:
: nil

on <2016-03-16 Wed> finished reviewing new cards on iphone,
synchronized from iphone, entered a bunch of new cards on mac, did
"ankiimport -RB ..." on mac, *then* launched Anki on mac.  at end of
this, the "new" cards i had read on the iphone were *still* marked
new.  maybe that's what happens?  i.e., the -RB load says "this is
recently changed", so then the "new --> old" on the iphone-reviewed
cards is ignored?

that seemed to happen again (same schedule of actions) on
<2016-03-17 Thu>.

*** TODO on getting imaret wrong ( right w/have been 10.1 mos), "leeched".

i had just moved it to this deck.


** enhancements

*** when moving old cards in to new place, mark as "new"?

or maybe an algorithm to "age" unreviewed cards?

problem being, that when cards are moved from an old deck, after
answering the first time, assuming the answer is correct, they go back
to "8.7 months", or some such.
